#include "factory_setting.h"






/**********************************************************************
** 函数名称         :FACTORY_Setting_Recover
** 创建人           :liupengcheng
** 创建日期         :2017 2017/11/14 19:44
** 最新修改人       :liupengcheng
** 最近修改日期      :2017 2017/11/14 19:44
** 功能描述         :恢复出厂设置以及第一次升级程序时的参数初始化
** 入口参数         :
** 返回参数         :
** 备注/注意        :
** QQ              : 1240612852
***********************************************************************/
void RECOVERY_Factory_Para()
{

	
	
	
}








