#include "version_manage.h"

//eg:例如当前的程序版本为 GERWOO_MC_1.1.1

uint8_t Software_Version[3] = {0x01,          0x00 };      
							  //软件大版本     //软件小版本									

uint8_t Hardware_Version[3] = {0x01,          0x00 };
                              //硬件大版本     //硬件小版本    


/*********************************************************版本管理************************************************************************/
//版本记录：硬件版本V1.0   软件版本V1.0     
//硬件源文件链接：链接：https://pan.baidu.com/s/1Uc0kCXdwW5EPtiN3rMAsOQ  提取码：nri7
//软件源文件链接：链接：https://pan.baidu.com/s/1wCPHbcwBdhRUAXqcnfUxsg  提取码：crb0 
//时间：2019年11月21日
//事件：刘鹏程（硬件PM）将Motion_Controller V1.0版本软件通过邮箱转发给李海（嵌入式软件工程师）
//刘鹏程邮箱：lpc1240612852@163.com
//李海邮箱：402746626@qq.com
/****************************************************************************************************************************************/


















