#ifndef __KEY_H
#define __KEY_H

#ifdef __cplusplus
extern "C" {
#endif

//1、头文件
/********************************************************************************************************************************************************************/

//2、宏定义
/********************************************************************************************************************************************************************/
#define ADC_00      0
#define ADC_160k    494         //up
#define ADC_68k     1001        //left
#define ADC_39k     1477        //ok
#define ADC_24k     1957        //right
#define ADC_15k     2434        //home
#define ADC_8k2     2983        //down
#define ADC_4k3     3425        //esc

#define AD_KEY_NONE     ((ADC_00 + ADC_160k)/2)         //274
#define AD_KEY_UP       ((ADC_160k + ADC_68k)/2)        //774
#define AD_KEY_LEFT     ((ADC_68k + ADC_39k)/2)         //1239
#define AD_KEY_OK       ((ADC_39k + ADC_24k)/2)         //1717
#define AD_KEY_RIGHT    ((ADC_24k + ADC_15k)/2)         //2195
#define AD_KEY_HOME     ((ADC_15k + ADC_8k2)/2)         //2708
#define AD_KEY_DOWN     ((ADC_8k2 + ADC_4k3)/2)         //3204
#define AD_KEY_ESC

//3、类型定义
/********************************************************************************************************************************************************************/
typedef enum
{
    KEY_NONE_Enum  = 0,
    KEY_UP_Enum    = 1,
    KEY_LEFT_Enum  = 2,
    KEY_OK_Enum    = 3,
    KEY_RIGHT_Enum = 4,
    KEY_HOME_Enum  = 5,
    KEY_DOWN_Enum  = 6,
    KEY_ESC_Enum   = 7,

    KEY_INVALID_Enum
}AbstractKey_Typedef;


//4、变量声明
/********************************************************************************************************************************************************************/


//5、函数声明
/********************************************************************************************************************************************************************/

//6、常量定义
/********************************************************************************************************************************************************************/
const static uint32_t AD_KEY_TABLE[] =
{
    AD_KEY_NONE, AD_KEY_UP, AD_KEY_LEFT, AD_KEY_OK, AD_KEY_RIGHT, AD_KEY_HOME, AD_KEY_DOWN, AD_KEY_ESC
};

#ifdef __cplusplus
}
#endif

#endif  /* __KEY_H */


