#ifndef _PIN_REMAP_H
#define _PIN_REMAP_H

//1、头文件
/********************************************************************************************************************************************************************/
#include "stm32f1xx_hal.h"

//2、宏定义
/********************************************************************************************************************************************************************/
//1、引用范围：key.c
////////*********************************************************/
//按键的原理是ADC按键，这里使用了两个ADC引脚做输入，
//每个ADC引脚下面接了8个按键，一共16个按键
//一个是PC5 ,一个是PB0
#define ADC_KEY_PORT1		 GPIOC          //还未匹配
#define ADC_KEY_PORT1_Pin1   GPIO_PIN_5     //还未匹配
/*******************************************************//////////

//2、引用范围:LCD12864.c
////////////*******************************************************/
// 0，开背光，1：关背光
#define LCD_BL_PORT		GPIOC 	             //还未匹配
#define LCD_BL_PIN		GPIO_PIN_13          //还未匹配
// 1：数据，0：命令
#define LCD_RS_PORT		GPIOA 	             //还未匹配
#define LCD_RS_PIN		GPIO_PIN_6           //还未匹配
// LCD控制选择，低电平使能
#define LCD_CS_PORT		GPIOC                //还未匹配
#define LCD_CS_PIN      GPIO_PIN_4           //还未匹配
// LCD复位， 低电平复位
#define LCD_RST_PORT	GPIOA                //还未匹配
#define LCD_RST_PIN    GPIO_PIN_4           //还未匹配
/*********************************************************///////////

//3、引用范围：Flash.c
////////////*******************************************************/
#define  EXFLASH_MOSI_PORT  GPIOD            //还未匹配
#define  EXFLASH_MOSI_PIN   GPIO_PIN_3       //还未匹配

#define EXFLASH_MISO_PORT   GPIOD            //还未匹配
#define EXFLASH_MISO_PIN    GPIO_PIN_4       //还未匹配

#define EXFLASH_CLK_PORT   GPIOD             //还未匹配
#define EXFLASH_CLK_PIN    GPIO_PIN_5        //还未匹配

#define EXFLASH_CS1_PORT   GPIOD             //还未匹配
#define EXFLASH_CS1_PIN    GPIO_PIN_6        //还未匹配

#define EXFLASH_CS2_PORT   GPIOD             //还未匹配
#define EXFLASH_CS2_PIN    GPIO_PIN_7        //还未匹配
/*********************************************************///////////

//4、引用范围：EEprom.c
////////////*******************************************************/

/*********************************************************///////////

//4、引用范围：Ex_adc.c
////////////*******************************************************/


//5、引用范围 DigitalCollect.c
/*********************************************************///////////


//5、引用范围 power.c
/*********************************************************///////////



//6.引用范围 RS485_Module.c
#define SW_Of_T_R_GPIO_Port     GPIOE
#define SW_Of_T_R_Pin           GPIO_PIN_15
//7.引用范围 sensor_port_bsp.h




//3、类型定义
/********************************************************************************************************************************************************************/


//4、变量声明
/********************************************************************************************************************************************************************/


//5、函数声明
/********************************************************************************************************************************************************************/







#endif





